closed_loop_AFC/jet_cylinder/physics-simulation-engine/fluid-openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
16200
(
(0.1077787 -0.016328877 9.0946545e-28)
(0.15852039 -0.010082433 0)
(0.33477772 0.0053574728 -3.5351397e-21)
(0.070454683 0.00024421552 0)
(0.39613722 0.014251482 2.0077886e-21)
(0.42119021 0.024772561 3.3369313e-21)
(0.14684601 0.00031503474 -3.6210809e-21)
(0.52461407 0.02483703 -2.952418e-21)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
21
(
(0.78366059 0 0)
(0.57261026 0 0)
(0.06887712 0 0)
(0.88122165 0 0)
(1.3557528 0 0)
(1.4924709 0 0)
(0.33434916 0 0)
(0.20825021 0 0)
(0.45978518 0 0)
(0.68410884 0 0)
(0.96749997 0 0)
(1.1241284 0 0)
(1.0511237 0 0)
(1.253546 0 0)
(1.1938148 0 0)
(1.4307486 0 0)
(1.4785336 0 0)
(1.4991077 0 0)
(1.3975645 0 0)
(1.4586231 0 0)
(1.3092951 0 0)
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
    jet1
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    jet2
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
