closed_loop_AFC/jet_cylinder/physics-simulation-engine/fluid-openfoam/system/flowRateJet1
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/flowRate/flowRatePatch.cfg"

name    jet1;


// ************************************************************************* //